app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-08-26 12:17:33.575502"], ["updated_at", "2020-08-26 12:17:33.575502"], ["title", "azdiazfojfaz"], ["deadline", "2010-10-10 00:00:00"], ["category_id", 2]]
---

document.getElementById("<%= @task.category.title %>-tasks").insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>");