app/controllers/emails_controller.rb

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
  def show
    @email = Email.find(params[:id])

SELECT "emails".* FROM "emails"
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "web-enabled"], ["body", "Synchronised client-server framework"], ["created_at", "2020-08-27 21:11:27.347190"], ["updated_at", "2020-08-27 21:11:27.347190"]]
---
  def create
  	  @emails = Email.all
      @email = Email.create(object: Faker::Company.buzzword, body: Faker::Company.catch_phrase, read: false)