app/controllers/tasks_controller.rb

    def create
      @task = Task.new(task_params)
      @category = Category.find(category_params)
      @task.category = @category
      if @task.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-08-26 11:51:38.888058"], ["updated_at", "2020-08-26 11:51:38.888058"], ["title", "AUZDA"], ["deadline", "2020-11-21 00:00:00"], ["category_id", 1]]

    def update
      @task = Task.find(params[:id])
      @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", true], ["updated_at", "2020-08-26 15:42:34.206696"], ["id", 11]]