app/views/emails/create.js.erb

document.getElementById("emails").insertAdjacentHTML("beforeend", "<%= j render 'email', email: @email %>")
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Up-sized"], ["body", "Cloned explicit pricing structure"], ["created_at", "2020-08-27 11:18:42.056093"], ["updated_at", "2020-08-27 11:18:42.056093"]]